{
  "format": "layers-model",
  "generatedBy": "keras v3.10.0",
  "convertedBy": "TensorFlow.js Converter v4.22.0",
  "modelTopology": {
    "keras_version": "3.10.0",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Sequential",
      "config": {
        "name": "sequential",
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [null, 50, 150, 1],
              "dtype": "float32",
              "name": "input_layer"
            }
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d",
              "filters": 32,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "same",
              "activation": "relu",
              "use_bias": true,
              "batch_input_shape": [null, 50, 150, 1],
              "dtype": "float32"
            }
          },
          {
            "class_name": "MaxPooling2D",
            "config": {
              "name": "max_pooling2d",
              "pool_size": [2, 2],
              "padding": "valid",
              "strides": [2, 2],
              "dtype": "float32"
            }
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_1",
              "filters": 64,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "same",
              "activation": "relu",
              "use_bias": true,
              "dtype": "float32"
            }
          },
          {
            "class_name": "MaxPooling2D",
            "config": {
              "name": "max_pooling2d_1",
              "pool_size": [2, 2],
              "padding": "valid",
              "strides": [2, 2],
              "dtype": "float32"
            }
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_2",
              "filters": 128,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "same",
              "activation": "relu",
              "use_bias": true,
              "dtype": "float32"
            }
          },
          {
            "class_name": "Dropout",
            "config": { "name": "dropout", "rate": 0.25, "dtype": "float32" }
          },
          {
            "class_name": "Flatten",
            "config": { "name": "flatten", "dtype": "float32" }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense",
              "units": 512,
              "activation": "relu",
              "use_bias": true,
              "dtype": "float32"
            }
          },
          {
            "class_name": "Dropout",
            "config": { "name": "dropout_1", "rate": 0.5, "dtype": "float32" }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_1",
              "units": 248,
              "activation": "sigmoid",
              "use_bias": true,
              "dtype": "float32"
            }
          }
        ]
      }
    }
  },
  "weightsManifest": [
    {
      "paths": [
        "group1-shard1of28.bin", "group1-shard2of28.bin", "group1-shard3of28.bin", "group1-shard4of28.bin", "group1-shard5of28.bin", "group1-shard6of28.bin", "group1-shard7of28.bin", "group1-shard8of28.bin", "group1-shard9of28.bin", "group1-shard10of28.bin", "group1-shard11of28.bin", "group1-shard12of28.bin", "group1-shard13of28.bin", "group1-shard14of28.bin", "group1-shard15of28.bin", "group1-shard16of28.bin", "group1-shard17of28.bin", "group1-shard18of28.bin", "group1-shard19of28.bin", "group1-shard20of28.bin", "group1-shard21of28.bin", "group1-shard22of28.bin", "group1-shard23of28.bin", "group1-shard24of28.bin", "group1-shard25of28.bin", "group1-shard26of28.bin", "group1-shard27of28.bin", "group1-shard28of28.bin"
      ],
      "weights": [
        { "name": "sequential/conv2d/kernel", "shape": [3, 3, 1, 32], "dtype": "float32" },
        { "name": "sequential/conv2d/bias", "shape": [32], "dtype": "float32" },
        { "name": "sequential/conv2d_1/kernel", "shape": [3, 3, 32, 64], "dtype": "float32" },
        { "name": "sequential/conv2d_1/bias", "shape": [64], "dtype": "float32" },
        { "name": "sequential/conv2d_2/kernel", "shape": [3, 3, 64, 128], "dtype": "float32" },
        { "name": "sequential/conv2d_2/bias", "shape": [128], "dtype": "float32" },
        { "name": "sequential/dense/kernel", "shape": [56832, 512], "dtype": "float32" },
        { "name": "sequential/dense/bias", "shape": [512], "dtype": "float32" },
        { "name": "sequential/dense_1/kernel", "shape": [512, 248], "dtype": "float32" },
        { "name": "sequential/dense_1/bias", "shape": [248], "dtype": "float32" }
      ]
    }
  ]
}
